### Worker's Data

In [2]:
# %pip install plotly
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import plotly.express as pe
import numpy as np

In [3]:
pd.set_option('display.max_column', None)
mb = pd.read_csv('workers_data-1.csv')

C = mb.select_dtypes(include = ['object','category'])
D = mb.select_dtypes(include = 'number')

print('Categorical Dataframe')
display(C.head())
print('\n\nNumerical Dataframe')
display(D.head())

Categorical Dataframe

,workclass,education,marital-status,occupation,relationship,race,gender,native-country
0,Private,Doctorate,Divorced,Exec-managerial,Not-in-family,White,Male,United-States
1,Private,12th,Never-married,Other-service,Own-child,White,Male,United-States
2,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
3,State-gov,7th-8th,Married-civ-spouse,Transport-moving,Husband,White,Male,United-States
4,State-gov,Some-college,Never-married,Other-service,Not-in-family,Black,Male,United-States

Numerical Dataframe

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week,income_>50K
0,67,366425,16,99999,0,60,1
1,17,244602,8,0,0,15,0
2,31,174201,13,0,0,40,1
3,58,110199,4,0,0,40,0
4,25,149248,10,0,0,40,0

In [4]:
# What is the average age of each Education Level.

o = mb[['education', 'age']]
o.groupby('education')[['age']].mean().sort_values(by = 'age', ascending = False)

                    age
education
7th-8th       49.621810
Doctorate     47.623134
1st-4th       46.349776
Prof-school   45.029412
Masters       44.008779
5th-6th       43.683761
Preschool     41.723684
9th           40.792398
HS-grad       39.013876
Bachelors     38.987394
Assoc-voc     38.586565
Assoc-acdm    37.870076
10th          37.628000
Some-college  35.678039
12th          32.207836
11th          31.803886

In [6]:
# Of all education level, what level has the most capital gain?

p = mb[['education', 'capital-gain']]
p.groupby('education')[['capital-gain']].sum().sort_values(by = 'capital-gain', ascending = False)

              capital-gain
education
Bachelors         12880864
Prof-school        8303782
HS-grad            8248327
Masters            6227671
Some-college       5434335
Doctorate          3165535
Assoc-voc          1369796
Assoc-acdm          949716
11th                337471
10th                333134
9th                 216699
7th-8th             209381
5th-6th             183426
12th                130384
Preschool            56248
1st-4th              22839

In [7]:
# What race has the most capital loss

q = mb[['race', 'capital-loss']]
q.groupby('race')[['capital-loss']].sum().sort_values(by = 'capital-loss', ascending = False)

                    capital-loss
race
White                    3444637
Black                     267187
Asian-Pac-Islander        127548
Other                      25561
Amer-Indian-Eskimo         14118

In [8]:
# What is the total capital loss for all Female that is Divorced

r = mb[['gender', 'marital-status', 'capital-loss']]
r = r.loc[(mb.gender == 'Female') & (mb['marital-status'] == 'Divorced')]
r.groupby(['gender','marital-status'])[['capital-loss']].sum()

                       capital-loss
gender marital-status
Female Divorced              199978

In [9]:
# In your advice, if you are gonna give a loan, what Marital Status would you consider

s = mb[['marital-status', 'income_>50K']]
s.groupby(['marital-status'])[['income_>50K']].sum().sort_values(by = 'income_>50K', ascending = False).head(1)

#The one with the highest income?

                    income_>50K
marital-status
Married-civ-spouse         8985

In [10]:
# SHow the total capital gain of all Doctorate education level

t = mb[['education', 'capital-gain']]
t = t.loc[(mb.education == 'Doctorate')]
t.groupby('education')[['capital-gain']].sum()

           capital-gain
education
Doctorate       3165535

In [11]:
# Who works the most total hours per week in the varying Occupation. What is the average capital gain of this class?

u = mb[['hours-per-week', 'occupation']]
u = u.groupby('occupation')[['hours-per-week']].mean().sort_values(by = 'hours-per-week', ascending = False).head(1)

uu = mb[['occupation', 'capital-gain']]
uu = uu.loc[mb.occupation == 'Farming-fishing']
uu = uu.groupby('occupation')[['capital-gain']].mean()

print('Who works the most total hours per week in the varying Occupation?')
display(u)
print('\n\nWhat is the average capital gain of this class?')
display(uu)

Who works the most total hours per week in the varying Occupation?

                 hours-per-week
occupation
Farming-fishing       46.494807

What is the average capital gain of this class?

                 capital-gain
occupation
Farming-fishing     722.63724

In [12]:
# What race is divorces the most.
v = mb[['race', 'marital-status']]
v = v.loc[mb['marital-status'] == 'Divorced']
v.groupby('race')[['marital-status']].count().sort_values(by = 'marital-status', ascending = False)

                    marital-status
race
White                         5118
Black                          634
Asian-Pac-Islander             103
Amer-Indian-Eskimo              78
Other                           38

In [13]:
# What Marital Status works the most total hours. What race mostly constitute this status

w = mb[['marital-status', 'hours-per-week']]
w = w.groupby('marital-status')[['hours-per-week']].mean().sort_values(by = 'hours-per-week', ascending = False)

ww = mb[['race', 'marital-status']]
ww = ww.loc[ww['marital-status'] == 'Married-civ-spouse']
ww = ww.groupby('race')[['marital-status']].count().sort_values(by = 'marital-status', ascending = False)

print('What Marital Status works the most total hours?')
display(w)

print('\n\nWhat race mostly constitute this status')
display(ww)

What Marital Status works the most total hours?

                       hours-per-week
marital-status
Married-civ-spouse          43.313446
Divorced                    41.072015
Married-AF-spouse           39.935484
Married-spouse-absent       39.685965
Separated                   39.519471
Never-married               36.867016
Widowed                     33.451613

What race mostly constitute this status

                    marital-status
race
White                        18030
Black                         1149
Asian-Pac-Islander             669
Amer-Indian-Eskimo             152
Other                          147

### The End